Masmiseim36/nxpSDK/devices/MKE16Z4/drivers/fsl_mscan.c
    /* MsCAN timing setting formula:
     * MSCAN_TIME_QUANTA_NUM = 1 + (TSEG1 + 1) + (TSEG2 + 1);
     */
    timingConfig.priDiv = priDiv;
    timingConfig.timeSeg1 = 3;
    timingConfig.timeSeg2 = 2;
    timingConfig.samp = 0;
    timingConfig.sJumpwidth = 0;

    /* Update actual timing characteristic. */
    MSCAN_SetTimingConfig(base, &timingConfig);
}

/*!
 * brief Initializes a MsCAN instance.
 *
 * This function initializes the MsCAN module with user-defined settings.
 * This example shows how to set up the mscan_config_t parameters and how
 * to call the MSCAN_Init function by passing in these parameters.
 *  code
 *   mscan_config_t mscanConfig;
 *   mscanConfig.clkSrc            = kMSCAN_ClkSrcOsc;
 *   mscanConfig.baudRate          = 1250000U;
 *   mscanConfig.enableTimer       = false;
 *   mscanConfig.enableLoopBack    = false;
 *   mscanConfig.enableWakeup      = false;
 *   mscanConfig.enableListen      = false;
 *   mscanConfig.busoffrecMode     = kMSCAN_BusoffrecAuto;
 *   mscanConfig.filterConfig.filterMode = kMSCAN_Filter32Bit;
 *   MSCAN_Init(MSCAN, &mscanConfig, 8000000UL);
 *   endcode
 *
 * param base MsCAN peripheral base address.
 * param config Pointer to the user-defined configuration structure.
 * param sourceClock_Hz MsCAN Protocol Engine clock source frequency in Hz.
 */
void MSCAN_Init(MSCAN_Type *base, const mscan_config_t *config, uint32_t sourceClock_Hz)
{
    uint8_t ctl0Temp, ctl1Temp;
#if !(defined(FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL) && FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL)
    uint32_t instance;
#endif

    /* Assertion. */
    assert(config);

#if !(defined(FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL) && FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL)
    instance = MSCAN_GetInstance(base);
    /* Enable MsCAN clock. */
    CLOCK_EnableClock(s_mscanClock[instance]);
#endif /* FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL */

    /* Enable MsCAN Module for configuartion. */
    MSCAN_Enable(base, true);

    /* Enter initialization mode for MSCAN configuration. */
    MSCAN_EnterInitMode(base);

    ctl0Temp = base->CANCTL0;
    ctl1Temp = base->CANCTL1;

    /* Enable Self Wake Up Mode. */
    ctl0Temp = (config->enableWakeup) ? ctl0Temp | MSCAN_CANCTL0_WUPE_MASK : ctl0Temp & ~MSCAN_CANCTL0_WUPE_MASK;
    /* Enable Loop Back Mode. */
    ctl1Temp = (config->enableLoopBack) ? ctl1Temp | MSCAN_CANCTL1_LOOPB_MASK : ctl1Temp & ~MSCAN_CANCTL1_LOOPB_MASK;
    /* Enable Listen Mode. */
    ctl1Temp = (config->enableListen) ? ctl1Temp | MSCAN_CANCTL1_LISTEN_MASK : ctl1Temp & ~MSCAN_CANCTL1_LISTEN_MASK;
    /* Clock source selection. */
    ctl1Temp = (config->clkSrc) ? ctl1Temp | MSCAN_CANCTL1_CLKSRC_MASK : ctl1Temp & ~MSCAN_CANCTL1_CLKSRC_MASK;

    /* Save CTLx Configuation. */
    base->CANCTL0 = ctl0Temp;
    base->CANCTL1 = ctl1Temp;

    /* Configure ID acceptance filter setting. */
    MSCAN_SetIDFilterMode(base, config->filterConfig.filterMode);
    MSCAN_WriteIDAR0(base, (uint8_t *)&(config->filterConfig.u32IDAR0));
    MSCAN_WriteIDMR0(base, (uint8_t *)&(config->filterConfig.u32IDMR0));
    MSCAN_WriteIDAR1(base, (uint8_t *)&(config->filterConfig.u32IDAR1));
    MSCAN_WriteIDMR1(base, (uint8_t *)&(config->filterConfig.u32IDMR1));

    /* Baud Rate Configuration.*/
    MSCAN_SetBaudRate(base, sourceClock_Hz, config->baudRate);

    /* Enter normal mode. */
    MSCAN_ExitInitMode(base);

    /* Enable Timer. */
    base->CANCTL0 =
        (config->enableTimer) ? base->CANCTL0 | MSCAN_CANCTL0_TIME_MASK : base->CANCTL0 & ~MSCAN_CANCTL0_TIME_MASK;
}

/*!
 * brief De-initializes a MsCAN instance.
 *
 * This function disables the MsCAN module clock and sets all register values
 * to the reset value.
 *
 * param base MsCAN peripheral base address.
 */
void MSCAN_Deinit(MSCAN_Type *base)
{
#if !(defined(FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL) && FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL)
    uint32_t instance;
#endif

    /* Disable MsCAN module. */
    MSCAN_Enable(base, false);

#if !(defined(FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL) && FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL)
    instance = MSCAN_GetInstance(base);
    /* Disable MsCAN clock. */
    CLOCK_DisableClock(s_mscanClock[instance]);
#endif /* FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL */
}

/*!
 * brief Gets the default configuration structure.
 *
 * This function initializes the MsCAN configuration structure to default values.
 *
 * param config Pointer to the MsCAN configuration structure.
 */
void MSCAN_GetDefaultConfig(mscan_config_t *config)
{
    /* Assertion. */
    assert(config);

    /* Initializes the configure structure to zero. */
    memset(config, 0, sizeof(*config));

    /* Initialize MsCAN Module config struct with default value. */
    config->baudRate = 1000000U;
    config->enableTimer = false;
    config->enableWakeup = false;
    config->clkSrc = kMSCAN_ClkSrcOsc;
    config->enableLoopBack = false;
    config->enableListen = false;
    config->busoffrecMode = kMSCAN_BusoffrecAuto;
    config->filterConfig.filterMode = kMSCAN_Filter32Bit;
}

/*!
 * brief Sets the MsCAN protocol timing characteristic.
 *
 * This function gives user settings to CAN bus timing characteristic.
 * The function is for an experienced user. For less experienced users, call
 * the MSCAN_Init() and fill the baud rate field with a desired value.
 * This provides the default timing characteristics to the module.
 *
 * Note that calling MSCAN_SetTimingConfig() overrides the baud rate set
 * in MSCAN_Init().
 *
 * param base MsCAN peripheral base address.
 * param config Pointer to the timing configuration structure.
 */
void MSCAN_SetTimingConfig(MSCAN_Type *base, const mscan_timing_config_t *config)
{
    /* Assertion. */
    assert(config);

    /* Enter Inialization Mode. */
    MSCAN_EnterInitMode(base);

    /* Cleaning previous Timing Setting. */
    base->CANBTR0 &= ~(MSCAN_CANBTR0_BRP_MASK | MSCAN_CANBTR0_SJW_MASK);
    base->CANBTR1 &= ~(MSCAN_CANBTR1_TSEG1_MASK | MSCAN_CANBTR1_TSEG2_MASK | MSCAN_CANBTR1_SAMP_MASK);

    /* Updating Timing Setting according to configuration structure. */
    base->CANBTR0 |= (MSCAN_CANBTR0_BRP(config->priDiv) | MSCAN_CANBTR0_SJW(config->sJumpwidth));
    base->CANBTR1 |= (MSCAN_CANBTR1_TSEG1(config->timeSeg1) | MSCAN_CANBTR1_TSEG2(config->timeSeg2) |
                      MSCAN_CANBTR1_SAMP(config->samp));

    /* Exit Inialization Mode. */
    MSCAN_ExitInitMode(base);
}

/*!
 * brief Writes a MsCAN Message to the Transmit Message Buffer.
 *
 * This function writes a CAN Message to the specified Transmit Message Buffer
 * and changes the Message Buffer state to start CAN Message transmit. After
 * that the function returns immediately.
 *
 * param base MsCAN peripheral base address.
 * param txFrame Pointer to CAN message frame to be sent.
 * retval kStatus_Success - Write Tx Message Buffer Successfully.
 * retval kStatus_Fail    - Tx Message Buffer is currently in use.
 */
status_t MSCAN_WriteTxMb(MSCAN_Type *base, mscan_frame_t *txFrame)
{
    uint8_t txEmptyFlag;
    mscan_mb_t mb = {0};
    IDR1_3_UNION sIDR1, sIDR3;
    /* Write IDR. */
    if (txFrame->format)
    {
        /* Deal with Extended frame. */
        sIDR1.IDR1.EID20_18_OR_SID2_0 = txFrame->ID_Type.ExtID.EID20_18;
        sIDR1.IDR1.R_TSRR = 1;
        sIDR1.IDR1.R_TEIDE = 1;
        sIDR1.IDR1.EID17_15 = txFrame->ID_Type.ExtID.EID17_15;
        sIDR3.IDR3.EID6_0 = txFrame->ID_Type.ExtID.EID6_0;
        sIDR3.IDR3.ERTR = (txFrame->type) ? 1 : 0;
        /* Write into MB structure. */
        mb.EIDR0 = txFrame->ID_Type.ExtID.EID28_21;
        mb.EIDR1 = sIDR1.Bytes;
        mb.EIDR2 = txFrame->ID_Type.ExtID.EID14_7;
        mb.EIDR3 = sIDR3.Bytes;
    }
    else
    {
        /* Deal with Standard frame. */
        sIDR1.IDR1.EID20_18_OR_SID2_0 = txFrame->ID_Type.StdID.EID2_0;
        sIDR1.IDR1.R_TSRR = 0;
        sIDR1.IDR1.R_TEIDE = 0;
        sIDR1.IDR1.EID17_15 = 0; /* Reserved for Standard frame*/
        /* Write into MB structure. */
        mb.EIDR0 = txFrame->ID_Type.StdID.EID10_3;
        mb.EIDR1 = sIDR1.Bytes;
    }
    /* Write DLR, BPR */
    mb.DLR = txFrame->DLR;
    mb.BPR = txFrame->BPR;
    /* Write DSR */
    uint8_t i = 0;
    for (i = 0; i < mb.DLR; i++)
    {
        mb.EDSR[i] = txFrame->DSR[i];
    }

