Masmiseim36/nxpSDK/devices/MKE16Z4/drivers/fsl_mscan.c
    /* 1.Read TFLG to get the empty transmitter buffers. */
    txEmptyFlag = MSCAN_GetTxBufferEmptyFlag(base);
    if (kMSCAN_TxBufFull == txEmptyFlag)
    {
        return kStatus_Fail;
    }

    /* 2.Write TFLG value back. */
    MSCAN_TxBufferSelect(base, txEmptyFlag);
    /* Push contents of mb structure into hardware register. */
    base->TEIDR0 = mb.EIDR0;
    base->TEIDR1 = mb.EIDR1;
    base->TEIDR2 = mb.EIDR2;
    base->TEIDR3 = mb.EIDR3;
    for (i = 0; i < mb.DLR; i++)
    {
        base->TEDSR[i] = mb.EDSR[i];
    }
    base->TDLR = mb.DLR;
    base->TBPR = mb.BPR;

    /* 3.Read TBSEL again to get lowest tx buffer, then write 1 to clear
    the corresponding bit to schedule transmission. */
    MSCAN_TxBufferLaunch(base, MSCAN_GetTxBufferSelect(base));

    return kStatus_Success;
}

/*!
 * brief Reads a MsCAN Message from Receive Message Buffer.
 *
 * This function reads a CAN message from a specified Receive Message Buffer.
 * The function fills a receive CAN message frame structure with
 * just received data and activates the Message Buffer again.
 * The function returns immediately.
 *
 * param base MsCAN peripheral base address.
 * param rxFrame Pointer to CAN message frame structure for reception.
 * retval kStatus_Success            - Rx Message Buffer is full and has been read successfully.
 * retval kStatus_Fail               - Rx Message Buffer is empty.
 */
status_t MSCAN_ReadRxMb(MSCAN_Type *base, mscan_frame_t *rxFrame)
{
    IDR1_3_UNION sIDR1;
    IDR1_3_UNION sIDR3;
    uint8_t i;
    if (MSCAN_GetRxBufferFullFlag(base))
    {
        sIDR1.Bytes = MSCAN_ReadRIDR1(base);
        sIDR3.Bytes = MSCAN_ReadRIDR3(base);
        rxFrame->format = (mscan_frame_format_t)(sIDR1.IDR1.R_TEIDE);

        if (rxFrame->format) /* Extended frame. */
        {
            rxFrame->type = (mscan_frame_type_t)(sIDR3.IDR3.ERTR);
            rxFrame->ID_Type.ExtID.EID28_21 = MSCAN_ReadRIDR0(base);
            rxFrame->ID_Type.ExtID.EID20_18 = sIDR1.IDR1.EID20_18_OR_SID2_0;
            rxFrame->ID_Type.ExtID.EID17_15 = sIDR1.IDR1.EID17_15;
            rxFrame->ID_Type.ExtID.EID14_7 = MSCAN_ReadRIDR2(base);
            rxFrame->ID_Type.ExtID.EID6_0 = sIDR3.IDR3.EID6_0;
        }
        else /* Standard frame. */
        {
            rxFrame->type = (mscan_frame_type_t)(sIDR1.IDR1.R_TSRR);
            rxFrame->ID_Type.StdID.EID10_3 = MSCAN_ReadRIDR0(base);
            rxFrame->ID_Type.StdID.EID2_0 = sIDR1.IDR1.EID20_18_OR_SID2_0;
        }

        rxFrame->DLR = base->RDLR & 0x0F;
        for (i = 0; i < rxFrame->DLR; i++)
        {
            rxFrame->DSR[i] = base->REDSR[i];
        }

        rxFrame->TSRH = base->RTSRH;
        rxFrame->TSRL = base->RTSRL;

        return kStatus_Success;
    }
    else
    {
        return kStatus_Fail;
    }
}

/*!
 * brief Performs a polling send transaction on the CAN bus.
 *
 * Note that a transfer handle does not need to be created before calling this API.
 *
 * param base MsCAN peripheral base pointer.
 * param txFrame Pointer to CAN message frame to be sent.
 * retval kStatus_Success - Write Tx Message Buffer Successfully.
 * retval kStatus_Fail    - Tx Message Buffer is currently in use.
 */
status_t MSCAN_TransferSendBlocking(MSCAN_Type *base, mscan_frame_t *txFrame)
{
    /* Write Tx Message Buffer to initiate a data sending. */
    if (kStatus_Success == MSCAN_WriteTxMb(base, txFrame))
    {
        /* Wait until CAN Message send out. */
        while (!MSCAN_GetTxBufferStatusFlags(base, MSCAN_GetTxBufferSelect(base)))
        {
        }

        return kStatus_Success;
    }
    else
    {
        return kStatus_Fail;
    }
}

/*!
 * brief Performs a polling receive transaction on the CAN bus.
 *
 * Note that a transfer handle does not need to be created before calling this API.
 *
 * param base MsCAN peripheral base pointer.
 * param rxFrame Pointer to CAN message frame to be received.
 * retval kStatus_Success - Read Rx Message Buffer Successfully.
 * retval kStatus_Fail    - Tx Message Buffer is currently in use.
 */
status_t MSCAN_TransferReceiveBlocking(MSCAN_Type *base, mscan_frame_t *rxFrame)
{
    /* Wait until a new message is available in Rx Message Buffer. */
    while (!MSCAN_GetRxBufferFullFlag(base))
    {
    }

    /* Read Received CAN Message. */
    if (kStatus_Success == MSCAN_ReadRxMb(base, rxFrame))
    {
        /* Clear RXF flag to release the buffer. */
        MSCAN_ClearRxBufferFullFlag(base);
        return kStatus_Success;
    }
    else
    {
        return kStatus_Fail;
    }
}

/*!
 * brief Initializes the MsCAN handle.
 *
 * This function initializes the MsCAN handle, which can be used for other MsCAN
 * transactional APIs. Usually, for a specified MsCAN instance,
 * call this API once to get the initialized handle.
 *
 * param base MsCAN peripheral base address.
 * param handle MsCAN handle pointer.
 * param callback The callback function.
 * param userData The parameter of the callback function.
 */
void MSCAN_TransferCreateHandle(MSCAN_Type *base,
                                mscan_handle_t *handle,
                                mscan_transfer_callback_t callback,
                                void *userData)
{
    assert(handle);

    uint8_t instance;

    /* Clean MSCAN transfer handle. */
    memset(handle, 0, sizeof(*handle));

    /* Get instance from peripheral base address. */
    instance = MSCAN_GetInstance(base);

    /* Save the context in global variables to support the double weak mechanism. */
    s_mscanHandle[instance] = handle;

    /* Register Callback function. */
    handle->callback = callback;
    handle->userData = userData;

    s_mscanIsr = MSCAN_TransferHandleIRQ;

    /* We Enable Error & Status interrupt here, because this interrupt just
     * report current status of MSCAN module through Callback function.
     * It is insignificance without a available callback function.
     */
    if (handle->callback != NULL)
    {
        MSCAN_EnableRxInterrupts(base, kMSCAN_StatusChangeInterruptEnable | kMSCAN_WakeUpInterruptEnable);
    }
    else
    {
        MSCAN_DisableRxInterrupts(base, kMSCAN_StatusChangeInterruptEnable | kMSCAN_WakeUpInterruptEnable);
    }

